backend/load-test.yml
config:
  target: "https://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Sustained load
  defaults:
    headers:
      Authorization: "Bearer ${ARTILLERY_TOKEN}"

scenarios:
  - name: "API Endpoints Load Test"
    flow:
      - get:
          url: "/api/newsletters"
          expect:
            - statusCode: 200
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "testpassword"
          expect:
            - statusCode: 200
      - get:
          url: "/api/recommendations"
          expect:
            - statusCode: 200