backend/load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Sustained load
  defaults:
    headers:
      Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjEyMzQ1Njc4OTAiLCJlbWFpbCI6InRlc3RAdXNlci5jb20ifQ.example_token"

scenarios:
  - name: "Get Newsletter Recommendations"
    flow:
      - get:
          url: "/api/recommendations/newsletters"
          expect:
            - statusCode: 200
          capture:
            - json: "$.newsletters.length"
              as: "newsletterCount"
      - log: "Received {{ newsletterCount }} newsletters"